on-the-importance-of-enforcing-invariants.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-03-04 Sat 00:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>On The Importance Of Enforcing Invariants</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Bryan Garza">
<meta name="description" content="Abstract types versus concrete types"
>
<meta name="keywords" content="ocaml, invariants, concrete types, abstract types">

<link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
<link href="./css/styles2.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="./css/styles.css"/>
</head>
<body>
<div id="preamble" class="status">
<h1 class="title"><a href="http://bryangarza.github.io">Bryan Garza</a></h1>
</div>
<div id="content">
<p>
<div class="outline-3"><h3><a href="./on-the-importance-of-enforcing-invariants.html"> On The Importance Of Enforcing Invariants</a><span> </span><span class="timestamp-wrapper"><span class="timestamp">( February 4, 2016)</span></span></h3>
</p>

<p>
Something that comes up early on when learning OCaml is the topic of abstract
types. Comparable to &ldquo;encapsulation&rdquo; in object-oriented programming, one purpose
of abstract types is to protect the programmer from misusing a module&rsquo;s
types. By abstracting the type, for example, presenting a <code>Number.t</code> instead of a
plain <code>int</code> type, the underlying implementation can be swapped out, without
affecting code using the module. Only by using the module can the user create a
value of that type, because only the module knows that <code>Number.t = int</code>, and has
ability to create that type.
</p>

<p>
Abstract types guarantee that the user can never access the concrete type
directly This is known as &ldquo;enforcing invariants&rdquo;, preserving certain properties
about the type, so that you can now assume they will always be true, i.e.,
<i>invariant</i>.  Placing this restriction on library users increases the level of
type safety significantly.
</p>

<p>
On the other hand, sometimes you <i>do</i> want to have concrete types in your
interface, and that&rsquo;s okay too. It gives more flexibility to the user, since
they can construct those types by hand, and have more detail about the internals
of the module.
</p>

<p>
</div>
</p>
</div>
<div id="postamble" class="status">
<a href="archive.html">Archive</a>
</div>
</body>
</html>
